# Дан произвольный список. Представьте его в обратном порядке.

arr = input('Введите список: ').split()
arr = arr[::-1]
print('Перевернутый список:', arr)